In [4]:
import pandas as pd
import numpy as np

In [5]:
m = np.random.randint(5,30, size=(5,3))

In [6]:
df = pd.DataFrame(m, columns=["var1", "var2", "var3"])

In [7]:
df.var1

0    17
1    11
2    22
3     6
4    26
Name: var1, dtype: int64

In [8]:
df[df.var1 > 15]

   var1  var2  var3
0    17     5     7
2    22    16     6
4    26    25    15

In [9]:
df[df.var1 > 15]["var1"]

0    17
2    22
4    26
Name: var1, dtype: int64

In [13]:
df[(df.var1 > 15) & (df.var2 < 15)]

   var1  var2  var3
0    17     5     7

In [17]:
df[(df.var1 > 15)][["var1","var2"]]

   var1  var2
0    17     5
2    22    16
4    26    25

In [18]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
0    17     5
2    22    16
4    26    25